# ShowEnhancedPullDownMenuGroupIcon

## Description
Determines if the group icon should be shown in the specified enhanced pull down menu.

```pascal
PROCEDURE ShowEnhancedPullDownMenuGroupIcon(
				liDialogID     : LONGINT;
				liComponentID  : LONGINT;
				bShowGroupIcon : BOOLEAN);
```

```python
def vs.ShowEnhancedPullDownMenuGroupIcon(liDialogID, liComponentID, bShowGroupIcon):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|liDialogID|LONGINT|   |
|liComponentID|LONGINT|   |
|bShowGroupIcon|BOOLEAN|   |

## Version
Availability: from VectorWorks12.5

## Category
* Dialogs - Modern